Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin
A plugin that can be used to add commands to the GUI

Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin.#ctor
Default constructor for a CommandHandlerPlugin

Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin.CanExecuteCommand(System.String)
Called to determine if a command can be executed
name:
The name of the command

Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin.CanExecuteRibbonTab(System.String)
Called to determine if a ribbon tab can be executed
name:
The name of the ribbon tab

Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin.ExecuteCommand(System.String,System.String[])
Called when a command is executed
name:
The name of the command
parameters:
Paramaters to be passed to the command

Autodesk.Navisworks.Api.Plugins.CommandHandlerPlugin.TryShowCommandHelp(System.String)
Called to tell the plugin to display help
name:
The name of the command
Returns:
Return true if you have handled this call